Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Webcomic_Star Chasing Boys (KO>EN).tmx
Source language: ko
Languages: en

source: 마법 발현 됐다는 것만 보여 줄 생각이야?
en: ...nothing more than our magic?

source: 앞으로 어떻게 해야 할지 생각해 봐야지…
en: we’d better figure out what to do next.

source: 너희들의 힘이자
en: ...but also your powers.

source: 그래가지고 곡이 어필이 돼요?!
en: how are we supposed to appeal this song otherwise?

source: 파앗
en: bam

source: 뭐!?
en: what?!

source: 슥
en: grab

source: 두리번-
en: glance

source: 쩡
en: clang

source: ...2군?
en: tier two?

source: 별을 쫓는 소년들
en: The Star Seekers

source: 공동기획 HYBE | WEBTOON
en: Co-planning HYBE | WEBTOON

source: 멤버들이 죽기라도 했으면 어쩌려고!
en: you almost killed them!

source: 각자 마법을 사용한 뒤에 대가를 치른다.
en: but each person faces different consequences afterward.

source: 안전한 곳으로 데려다줄게!!
en: I’ll take you somewhere safe!

source: 금방 나을 거야.
en: I’ll get better soon.

source: 이쪽으로 오세요!!
en: everyone, come this way!

source: 우와… 내가 한 거 맞아?
en: wow... did I really do that?

source: 얼른 와
en: hurry!

source: 띠링~
en: ding

source: 적어도 게스트급은 맞춰야 할 거 아냐?
en: who are they to call special?

source: 홱
en: swing

source: 울지 않는다고 그 사람이 슬프지 않은 건가?
en: just because one doesn’t cry doesn’t mean they’re not sad.

source: 화앗
en: flash

source: 뭐하는 거야?!
en: what are you waiting for?!

source: 비켄 형, 인과율에 대해서 들었으면서....
en: even though he heard about the causality he’s still...

source: 우와..어쩌냐
en: yikes...

source: 우와...{j}적응 안 되네.
en: wow... I’ll have to get used to this.{j}

source: 팟
en: flash

source: 미안.
en: sorry about that.

source: 아까도 말했지만
en: like I said earlier...

source: 내가 진짜 하늘을 날고 있잖아!
en: I’m actually flying in the air!

source: 혹시 제가 어떤 마법을 쓸 수 있는지 알 수 있어요?
en: then can I know what kind of magic power I have?

source: 실현 시킬 수 있느냐와 그렇지 못하느냐가 판가름 난다.
en: ...determines whether it leads to manifestation.

source: 어… 응!
en: oh... okay!

source: 마법을 빌려 사용할 수 있다.
en: One can borrow magic from someone else.

source: 예.{j}모르시겠죠.{j}마법이 나타나고 10년 동안
en: it is no surprise you have never heard of it. only a few people...{j}{j}

source: 솔
en: soule

source: 이거 식물들의 포자구나.
en: these must be the spores.

source: 너희들은?
en: what about you guys?

source: 이러면 어때?
en: I have an idea.

source: 화륵
en: blaze

source: 스륵
en: swish

source: 맹세컨대 난 거짓말은 일절 하지 않았어.
en: I swear everything I said was nothing but the truth.

source: 모든 마법의 지식이 담긴 책이잖아.
en: it contains every piece of knowledge about magic, after all.

source: 여긴 어디야?
en: where are we?

source: 형들이 잘해 줘야 돼.
en: ...I need all of your help.

source: 솔이 형 개인 스케줄 잡혔나 보네
en: soule’s got his own gig already?

source: 조금이라도 있는 마법이든 지식이든 모든 것을 동원해
en: who have done painstaking research using what little magic or knowledge they had...

source: 지금 누굴 걱정해?
en: you’re not the one to worry here!

source: 무슨 일이야?
en: what’s wrong?

source: 솔이 형!{j}괜찮아?!
en: soule! are you okay?{j}

source: 슈아아악
en: fwoosh

source: 아비스는?
en: what about avys?

source: ..통화 중이 아니잖아?
en: he’s not talking to anyone on the phone!!

source: 열심히 하세요.
en: good luck.

source: 난 그냥 너희 안에 닫혀 있던 문을 열어주는 것뿐이야.
en: opening the closed door you’ve had within you all along.

source: 고양이?
en: a cat?

source: 진짜!!
en: seriously?!

source: 제 10 화
en: Episode 10

source: ESTIMMO 피부관리샵
en: ESTIMMO Skin Care

source: 우리 중에 무대에 대한 욕심은 유진형만 한 사람이 없을걸?
en: eugene has the highest standards for performances of us all.

source: 응!{j}지금 가!
en: okay, I’m coming.{j}

source: 진영이...내 친구가 있던 곳이 병원일 거야.
en: I’m pretty sure my friend jinyeong was at the hospital.

source: 그런데…
en: that aside...

source: 꺼져.
en: get lost.

source: 확
en: fwoosh

source: 성인 후에는 발현하기도 힘든데 격이 달라요, 격이.
en: it’s hard to manifest once you become an adult, yet they did. at an extraordinary level, at that.

source: 누구신지 모르지만
en: and I don’t know who it was...

source: 탁
en: thunk

source: 지금 컨디션이 안 좋은가 봐.
en: I guess I’m not in a great mood today.

source: 당신들 정체가 뭐예요?
en: who are you?

source: 2군이니 실패작이니 온갖 무시를 받으며
en: we finally got to perform on stage...

source: 이거 저도 꼭 해야 돼요?
en: do I have to do this?

source: 왜, 다시하면 못쓰던 마법이라도 쓸 수 있게 돼?
en: why? will you miraculously be able to use magic this time?

source: 분명히 전부 빈 페이지 였는데..??
en: I’m pretty sure all of the pages were empty last time...

source: ...촬영은 딱 한 번이야.
en: you only get one chance.

source: 디케이라고 한다
en: ...dk.

source: 제대로 준비하려면 일분일초가 아깝다! 지금 당장 일정 짜자구!
en: we need all the time we can get to put the ultimate stage together!! set the dates right now, chop-chop!

source: 마법 발현이 늦은 원인은
en: avys, your magic wasn’t unleashed until now...

source: 주섬
en: rustle

source: 걔는 진작 잘랐어.
en: I fired him ages ago.

source: 제 8 화
en: Episode 8

source: 아비스!
en: avys!

source: 통증은 좀 어떻습니까?
en: how is your pain?

source: 두 번 다시 힘을 쓸 수 없게 되는 것이 보통이었죠!
en: ...and never got to use their powers again!

source: 분명히 나한테 그랬다고, 형이.
en: ha

source: 울컥
en: grit

source: 마법이 발현 된 사람들은
en: when magic is manifested...

source: 롯 성공적인 월드 투어 마치고 귀국
en: “lote” returns after a successful world tour

source: 야아아아아!!!!
en: avys!!!!

source: 쟤들은 마법 쓰는 거 하나뿐이야.
en: “all they have is magic tricks.”

source: 콰앙
en: boom

source: 어...안색이 나쁜데...?
en: he doesn’t look so well.

source: 죽게 두지 않아.
en: I wouldn’t have let that happen.

source: 진짜 어디 아픈가??
en: are you okay, kitty?

source: 우와!!
en: wow!!

source: 비켄?!{j}어떻게...
en: viken? how...?{j}

source: 꺄아~
en: kyaaa

source: 들어 본 적 있겠지?
en: I’m sure you’ve heard about that rule before.

source: 그전에!!
en: before we start!

source: 병원에서 사료랑 습식캔 사 왔어.
en: we picked up some cat food at the clinic.

source: 대단한!
en: something more impressive!

source: 사락
en: sparkle

source: 필요한 것은 간절함을 의식해서 집중할 것.
en: what matters is to focus while staying cognizant of your desperate heart.

source: 숙박비 같은 거랄까?
en: supposed I’m paying for the stay.

source: 이럴 줄 알았다.
en: I knew this would happen.

source: 와인전문
en: Wine Shop

source: 또각
en: clack

source: 미안....
en: I’m sorry...

source: 펄럭
en: flap

source: 획
en: turn

source: _x0008_DK형!{j}괜찮아요?!!
en: dk! are you okay?!{j}

source: 자주자주 체크해!
en: check your social media frequently!

source: 아비스
en: avys

source: 괜찮아.{j}아무렇지 않아
en: yeah, I’m fine.{j}

source: 꼬르륵...
en: gurgle

source: 운명의 소년이라니…
en: the boys of destiny?

source: 협조 부탁드립니다.
en: we’d like to ask you for your cooperation.

source: 또 아이들과 우리를 떨어뜨려 놓으려는 건가?
en: are they trying to separate us from the boys again?

source: 그리고…
en: also...

source: 오늘 또 라이브 하는 거?
en: another livestream today?

source: 감독님들 눈에 더 잘 띌 수 있게...
en: if we want to catch the directors’ eyes...

source: 아이들 대피 시킬 수 있게 엄호 부탁해!!
en: please cover for me so I can get the kids out of here!!

source: 너희들이 운명의 소년들이야.
en: you are the boys of destiny.

source: 가는 길이 다르다?
en: a different path, she says? those hypocrites...

source: ...여기
en: something about this place...

source: 쩌, 쩔어!
en: th-that’s awesome!

source: 후다닥
en: rush

source: 그건 또 뭐예요?
en: what’s that?

source: 연희뉴스
en: Yonhee News

source: 덥석
en: grab

source: 모두를 구한다니?
en: what did she mean by “redemption for everyone”?

source: 시간이 좀 촉박하긴 한데...
en: we’re a little tight on time,

source: 유진형, 우리 연습하는 것 좀 도와줘
en: eugene, can you help us with our practice...

source: 애드리브라도 할까?
en: should I improvise something?

source: 그렇게 앉아있다 죽고 싶지 않다면.
en: unless you want to die while sitting there.

source: 내가 뭐라도 해야 돼!
en: I need to do something, anything!!

source: …건방지게 굴더니 결국 힘이 다했나 보구나?!
en: looks like you brat’s all out of energy!

source: 그때 이후로...
en: I wonder if he’s gotten better...

source: 이…이게 무슨…
en: wh-what’s this...?

source: 정말 인과율 때문이라고 해도
en: causality might be one reason...

source: 없음
en: none.

source: 19세 이전에 마법이 발현되는 것이 일반적이나,
en: for most, magical abilities manifest before the age of 19.

source: 계약기간이 남았으니 오늘부터 모든 지원을 최소화!
en: since your contract isn’t over yet, I’m reducing your resources to the minimum!

source: 평소의 기세 넘치던 형 어디 갔어? 오랜만의 무대라 쫄았어?
en: where’s my enthusiastic, passionate eugene? are you scared about going on stage in a long time?

source: 어?{j}저거 피 아닌가?
en: wait, is that blood on its leg?{j}

source: 아- 빨리 줘요.{j}우리 멤버들한테도 빨리 가봐야 한다구요!
en: hurry and give me your hand! I need to go check on the other members.{j}

source: 앞으로는 어떨지 모르지만…
en: so far, that is...

source: 심병원
en: Heart Hospital

source: 걱정 끼쳐서 미안.
en: sorry for causing you trouble.

source: 꺄아아아
en: arghhh

source: 응??
en: what?

source: 그렇게 부단히 노력해
en: and thanks to their hard work...

source: 뭐라도 좋으니까!!!
en: anything!

source: 지금 우리 모습이 화면에 잘 나오고 있을까?
en: ...but do we look okay on the screen?

source: 폭발적인 마법을 발현
en: ...by someone over the age of 19.

source: 와, 아직도 안 움직이네.
en: wow, it didn’t budge even a little bit.

source: 마법 같은 거 말고 다른 방법을 생각해 볼 수 없었던 거야?
en: could you have thought of trying something else, other than magic?

source: 좋았어!{j}사람들 대피도 끝났고 조금만 더 힘내자!
en: it’s going great! now that almost everyone’s evacuated, I just have a little bit more to go!{j}

source: 비켄?!
en: viken?

source: 콱
en: clench

source: 흐음...
en: hm...

source: 제가 설명드릴 수 있는 부분이 아닙니다.
en: I cannot give you an explanation for that.

source: ···다시 할 수 있을지도 전혀 모르겠고..
en: and I don’t even know if I can do that again.

source: 환영마법 같은 건가?
en: you mean by like a hallucination magic?

source: 마법에 상응하는 상처를 입는다.
en: I bear a scar that corresponds to my magic.

source: 으아아!!
en: ahhh!

source: 유진형!!
en: eugene!!

source: 그렇지?{j}나도 유진 형이랑 합을 맞춰야 더 안심이 될 거 같아.
en: good point. I’d also feel more confident if I could practice with eugene.{j}

source: 네가 쉬는 만큼 무대 완성도가 떨어지겠지.
en: you’ll still need to take time off, which means our performance will be less than ideal.

source: 컥!
en: argh!

source: 힐긋
en: glance

source: 뭔지 말 안 해 줄 거야?
en: I heard you mention my name.

source: 아 그래?
en: all right.

source: 솔 씨가 건강을 완전히 회복할 때까지
en: while soule recovers...

source: 투캉
en: pow

source: 여깁니다.
en: over here.

source: 그럼 우린...
en: if that’s the case...

source: 언제나 곁에 있었어.
en: we’ve always been with you...

source: 스타원!!!
en: introducing star one!

source: …그게 뭐죠?
en: what’s that?

source: 탓-
en: dash

source: 저 무대 다음이 우리지?
en: we’re going after them, right?

source: 꽈악
en: clench

source: 그런 중요한 무대에서 우릴 응원해주는 팬들한테
en: with that said, do you seriously plan to show our dearest fans...

source: 반야님께서 기뻐하시겠군.
en: ...banya must be very happy.

source: 다들 무사히 있어줘!
en: I hope everyone’s safe!

source: 아냐.{j}그러면 안돼.
en: no, I shouldn’t.{j}

source: 도대체 얼마나 멍청한 거야?
en: seriously, how ignorant are you?

source: 더욱더 강렬한 마법을 보여주기까지 했죠!
en: ...since the terrorists started to attack!

source: 병원에선 뭐래? 다린엔 약 발랐고, 크게 아픈 데 없대. 유기된 거 아닐까 하던데? 아님 사고로 집을 나온 거던가.
en: it’s perfectly healthy and the wound's been dressed. the doctor suspects it was abandoned or accidentally left its home and got lost.

source: 안녕하세요.{j}오늘 약속한...
en: hello, everyone. today, as I promised...{j}

source: 대표님!
en: what, why?!

source: 여러분처럼 강한 마법사가 앞장서야 합니다!
en: we need leadership from powerful wizards like you!

source: 도와줄까?
en: should I give you a hand?

source: 화악
en: flash

source: 무사해서 정말 다행이야
en: what a relief no one got hurt.

source: 이곳에서는 대가의 부담을 줄여서 시도해 볼 수 있을지도 모르겠군.
en: we could leverage the reduced magnitude of consequences here.

source: 마법 발현이 안 되면…
en: kids like you...

source: 오 좋다.{j}치킨!!
en: fried chicken sounds good!!{j}

source: 뉴스에서 봤어.
en: You’re making a comeback soon, right?

source: 타시죠.
en: get in.

source: 그런 건 한 번이면 충분해.
en: I’ve had enough of those.

source: 슉-
en: slide

source: 아비스에 비켄까지 발현에 성공했다고?!
en: avys and viken also manifested their powers?!

source: 에고고…
en: uh-oh...

source: 쌔액
en: whish

source: 촤악
en: slash

source: 뭐라고요?!
en: what?!

source: 유진 형은 그 안으로 뛰어 들어줘.
en: eugene, your job is to jump into it.

source: 그동안 정신 없어서 제대로 못 뵈었지?
en: you’ve been too busy to spend time with her, haven’t you?

source: 애들아
en: guys.

source: 있긴 하지.
en: we sure did.

source: 혹시 그 스케줄..
en: about this show you want me to do...

source: 마법이 나타나고 10년 동안
en: few people have.

source: 비켄 형의 치유 마법이면 조금이라도 빨리 어떻게 해볼 수 있지 않을까 해서 마음이 급했어.
en: ...and I made the rash decision thinking that maybe viken’s healing magic could help more quickly.

source: 역시 다쳐서 못 움직인 거였어?
en: it must be injured. no wonder it didn’t run away.

source: 죽어봐라!!
en: I’ll kill you!!

source: 주먹다툼도 아니고 마법을 쓰는 상대한테 무작정 달려들면 위험하다고!
en: this is not an ordinary fist fight! you can’t just charge at an enemy that uses magic!

source: 갑자기 내용이 생긴 게 맞아.
en: ...some texts appeared out of nowhere.

source: …형.
en: eugene...

source: 너 뭐야, 고양이 아니었어?
en: what are you? I thought you were just a cat.

source: 스타원!
en: next up, star one.

source: 예.{j}모르시겠죠.
en: it is no surprise you have never heard of it.{j}

source: 마법을 쓸 줄만 알았다면!!!
en: ...that my mom has!

source: 우리도 아는 사람?
en: have we met this person?

source: 탓
en: leap

source: 이번엔 반드시 성과가 있을 겁니다.
en: it will work this time, I promise.

source: ...으...
en: ugh...

source: ㅎㅇㅎㅇ~~
en: hiya!

source: 털썩
en: plop

source: 1화
en: episode 1

source: 너 어디에서 왔니?
en: where are you from?

source: 감히
en: how dare you...

source: 아무것도 못 하는 나 자신이 얼마나 한심하게 느껴지는지.
en: how powerless it feels when you can’t be of any help?

source: 팬들과의 소통이 얼마나 중요한지 알지?
en: I’m sure you know the importance of engaging with your fans.

source: 오늘의 마지막 무대입니다!
en: the last performance of the day is brought to you by...

source: 으...
en: ah...

source: 타호야!!!
en: taho!!

source: 이 병원은 급하게 물색한 곳이라 마땅치 않네요.
en: this hospital is not the best place as we found it in a hurry.

source: 진정해.
en: calm down.

source: 솔이 형!
en: soule!

source: 해야만 해
en: I must do something!

source: 왜 그러고 사냐?!
en: what’s wrong with me?!

source: 쿠당
en: thump

source: 저기...
en: um...

source: 이쪽으로 피하세요!
en: come hide this way!

source: 촤아악
en: fwoosh

source: 저거 피 아닌가?
en: it must be injured. no wonder it didn’t run away.

source: 하지만 무대에 오를 준비 제대로 하려면 유진 형도 이제 알아야 할거 같아.
en: but I think eugene should know in order to prepare for the performance.

source: 힘내라!!
en: Good luck!!

source: 정체불명의 아이돌 테러단체 극성.
en: an unidentified idol terrorist organization runs rampant.

source: 어?
en: huh?

source: 주륵
en: drip

source: 긁적
en: scratch

source: 이게 대체 뭐지?{j}어디서 갑자기 생겨난 거야?
en: but what are these? where did they come from?{j}

source: 다들 피해!!!!
en: everybody, run!

source: 뭐?
en: what?

source: 첨단 과학으로도 정복하지 못해서 자연에게 굴복당해 희생되거나
en: to prevent humanity from succumbing to nature that cutting-edge science could not control...

source: 여기 사는 사람들 왜 그래?!
en: what’s up with these people?!

source: 움찔
en: wince

source: 지금 바로 데려가겠습니다.
en: I’ll take him there now.

source: 맞아, 공짜는 없지.
en: you’re right. nothing comes for free.

source: 그나저나 진영이는 계속 답도 안 주고...
en: that aside, jinyeong still hasn’t gotten back to me yet.

source: 비켄의 어깨 가시를 보니
en: and judging from the thorns on viken’s back...

source: 번쩍
en: flash

source: 안녕하세요~
en: Hello!

source: 아냐.{j}괜찮아.
en: nah, it’s okay.{j}

source: 억?!
en: whoa!

source: 그래가지고 관객이 오겠어??
en: no one would come to watch our performances!

source: 형...
en: soule...

source: 각종 광고 촬영, 예능 출연, 화보, 인터뷰까지
en: we spent the busiest week since our debut,

source: 뭐 이런 경우가....
en: what in the world...?

source: ..{j}내가 한 거야?
en: did I do this...?{j}

source: 우와...
en: whoa...

source: 지금 냉장고에 뭐 있어?
en: what’s in the fridge?

source: 고작 가능성이 보이는 꼬마 하나를 데려오라는 게 이렇게 시간이 오래 걸릴 일인가?
en: what’s taking so long? all I asked you was to bring me a kid with potential.

source: 안심하세요.
en: worry not.

source: 벌떡
en: jolt

source: 어렸지만 여러분들도 그 시기를 함께 지냈으니 기억하시죠?
en: you were young, but I am sure you also have a living memory of the time.

source: 팡
en: pow

source: 옙!!
en: yessir!!

source: 분위기가 바뀌었다?!
en: ...look different.

source: 콰득
en: crack

source: 어라라
en: come on!

source: 예.{j}열심히 하겠습니다.
en: thank you. we’ll do our best.{j}

source: 까득
en: grit

source: 채널 오픈했잖아?
en: he started his own channel?

source: 쐐액
en: fwoosh

source: 퍽
en: wham

source: 천막은??{j}우리 지금 뭐에 홀린 건가?
en: and what about the tent?? did we get bewitched or something?{j}

source: 응?
en: hm?

source: 나중에 좋은 집사 찾아 줘야지.
en: we should find a good owner.

source: 매니저 형도 다쳤잖아요, 손.
en: I know you hurt your hand too, dk.

source: 풀썩
en: flump

source: 어떻게 한 거지??
en: how though??

source: 핏
en: rip

source: 그러니까 제발!!
en: so please!

source: 바,, 방금 뭐가 보인거야?
en: wh-what did I just see?

source: 책임을 져야 할 거다
en: ...for tonight’s failure.

source: 그리고 기대했죠.
en: the world was excited.

source: 할 수 있는 게 있다면 뭐든 해야 돼!
en: I must do everything I can!

source: 스윽
en: swish

source: 키앙
en: freeze

source: 뭔가 좀 이상하지 않아?
en: don’t you find dk a little strange?

source: 그런 거 없어도 내가 누구보다 더 잘할 수 있다고
en: that I could be the best without any of that.

source: 됐어.
en: don’t worry about it.

source: 큰 박수와 함성으로 맞아주세요!
en: please welcome them with a big round of applause!

source: 롯의 아들이라고 그렇게 돈 들여서 홍보를 해놨는데..
en: I spent all that money on your promotions because you’re lote’s son.

source: 영화에 나오는 보물상자 같은
en: like a pandora’s box you see in movies

source: 아니!
en: of course I should!

source: 안돼!!!
en: no!!!

source: 아이돌 테러한다는!
en: the one that terrorizes idols?!

source: 그럼 이 방법이 최고라고 생각해.
en: I think this would be the best way to make that happen.

source: 몸 상태는 어떠십니까?
en: how are you feeling?

source: 더군다가 정확하게 매직 아일랜드도 아니잖아.
en: we’re not exactly on magic island either.

source: 도움이 필요해?
en: do you need help?

source: 성심병원
en: Sacred Heart Hospital

source: 벅벅
en: shake shake

source: 무례하게 굴 생각은 없었습니다.{j}타시죠.
en: I did not intend to be rude, ma’am. please get in.{j}

source: 예.{j}지금 눈앞에 있는 여러분들입니다.
en: yes, you five are those wizards.{j}

source: 어느 정도?
en: how big?

source: 난 이 아이 엄마예요!
en: I am his mother!

source: 형!!!
en: hyeong!

source: 저벅
en: step

source: 조금만 참아!
en: hang tight for just a second!

source: 형 괜찮아?
en: soule, are you okay?

source: 죄송합니다.
en: I am sorry.

source: 분위기 왜 이래?
en: what’s going on here...?

source: 내가 더 놀랬어~!
en: you scared me, eugene!

source: 이 고양이는 뭐야?
en: anyway, what’s with the cat? do you know it?

source: 아오~
en: ugh!

source: 근데… 왠지 이번이 끝이 아닐 것 같은 생각이 들어…
en: but... I have a feeling this won’t be the end of things.

source: 그래도 네 소식 계속 신경 써주고 있다며.
en: still, he seems to care about you.

source: 제 14 화
en: Episode 14

source: 어, 됐다!!
en: it worked!

source: 촬영하시는데 문제없도록 특수효과 팀에도 잘 말해놨고요.
en: I already spoke with the special effects team so that we don’t run into any issues during the shooting.

source: 아비스!!
en: avys!!

source: 화르륵
en: crackle

source: 오늘 너희들이 최고 하이라이트인 거 알지??
en: you know you guys are the highlight of today’s program, right?

source: 팟팟팟팟-
en: whack

source: ...네?
en: pardon?

source: 타호
en: taho

source: 솔이 형이 너무 걱정이 많은 거야 그리고 우리 계획 잘 실행하려면...
en: soule, you worry too much. and for our plan to work--

source: 벌컥
en: swing

source: 말씀하신 대로 덫을 준비 중입니다.
en: we are preparing a trap as you mentioned, sir.

source: 신체단련
en: fitness training

source: 한 번만 더 냉정하게 생각…
en: why don’t you think it through--

source: 안락하게 모시겠습니다.
en: we’ll make your flight comfortable, sir.

source: ...다들 너무 기죽지마.
en: come on, cheer up.

source: 또 보자고.
en: we’ll meet again.

source: 그렇지?
en: good point.

source: 피 엄청나잖아요!!
en: you’re bleeding so much!

source: 갑자기 사슴뿔 달린 남자가 무시무시한 창을 들고 있는 게 보이던데 왜 그런 환영을 보여주는 거지?
en: what was the point of showing me a man with antlers holding a giant spear anyway?

source: 그렇네.
en: I see.

source: 퍼엉
en: blast

source: 후웅
en: whoosh

source: 아, 그렇군요.{j}직원에게 전달해 두겠습니다.
en: ah, is that so? I will let the staff know and have them bring it to you.{j}

source: 지금까지 그렇게 대규모의 마법을
en: how many people...

source: 솔님을 안전한 곳으로 모시겠습니다.{j}협조 부탁드립니다.
en: we will take mr. soule to a safer place. we would like to ask you for your cooperation.{j}

source: 제 15 화
en: Episode 15

source: 어떻게...
en: how...

source: 왜 이렇게 껄끄러울까…
en: ...but something about him bothers me.

source: 뭐가 어떻게 된 거..
en: what just happened...?

source: 오늘 방송 1군만 출연한다며?
en: I thought only tier one groups are performing today.

source: 끼릭
en: click

source: 빨리 빨리 안다녀?!
en: you’re late!

source: 이곳이 보였고 결국 들어왔으니
en: you found this place and decided to come in.

source: 병원으로 가는 건데 보안이 무슨 상관이지?
en: what security concern do you have on the way to the hospital?

source: 안 그럼 다들 무슨 수로 스케쥴을 소화하겠어?
en: if not, how does everyone else handle their busy schedules?

source: 첫 업로드 날짜가 어제...
en: his first upload was yesterday.

source: 유진 형이 아직…
en: but eugene is still...

source: 기대할게!
en: I look forward to it!

source: 아오!{j}진짜!!{j}왜 안 되는 거야!
en: ugh, come on!! why isn’t my magic working?!{j}

source: 특히 솔이 너한테 제일 실망이 크다.
en: you disappointed me the most, soule.

source: 마법도 못쓰는 2군이라는 말 들을 때마다
en: every time people looked down on us for being magicless tier-twos...

source: 일반통행
en: ONE WAY

source: 잘 할 수 있어...
en: I can do it.

source: 어・・・
en: no way...

source: 어제 공연장에서 저희 개인 물품 챙겨다 주신다고 했는데
en: we were told that you’d bring our personal belongings from the venue...

source: 솔이형!!!
en: soule!!

source: 대답 안해?!
en: answer me!

source: 예?
en: excuse me?

source: 소수의 사람들만이 소소하게 쓸 수 있는 마법으로는
en: we cannot achieve utopia...

source: ㅋㅋ
en: haha

source: 아무 대가도 없이?
en: and at no cost?

source: 난 아까 마법훈련 열심히 받을 거라고 결심했거든!
en: I promised myself earlier that I’d take the magic training seriously.

source: 누구??
en: who is this?

source: 한 번은 해내더라도 인과율에 무너져서
en: even those who somehow managed to pull it off were overwhelmed by the causality...

source: 새로운 시대를 위해 많은 사람들이 질문을 던지고
en: many people have asked questions...

source: 쿠웅
en: thud

source: 솔이 정도 마법이면 여기저기서 와달라고 할걸.
en: with his magical powers, of course he’s in high demand.

source: 기합 빡!
en: let’s do this!

source: 잘 됐네.{j}나도 너희랑 친해질 생각은 없거든.
en: good. I don’t want to be friends with you either.{j}

source: 저기…
en: um...

source: _x0008_DK형!
en: dk!

source: 가슴이!
en: my chest...!

source: 괜히 쫄았네…
en: you scared me...

source: 콰쾅
en: crackle

source: 학교도 고등학교까지 내내 같이 다녔어.
en: ...and went to the same schools until high school.

source: 앗, 잠깐…
en: wait a-!

source: 웬 듣보.
en: never heard of them.

source: 쩌저정
en: clink

source: 어라?{j}안 먹어?{j}ㅠㅠ
en: huh? you don’t want it? :({j}

source: 다음 차례에 맞게 세팅 체크 부탁드려요!
en: please double-check the audio settings!

source: 괜찮을 거야.
en: he’ll be fine.

source: 쐐애액
en: fwoosh

source: 아, 그리고 유진 형 안무에 맞추려면
en: oh, and we could make soule’s shield larger

source: 음향팀!
en: audio team!

source: 만약 그런 거면 어떡하지?
en: what if that’s really the case?

source: 그런 것치곤 너무 생생했는데...
en: it was so vivid for a dream.

source: 어라?!
en: huh?

source: 취칙
en: spritz

source: ...미안해 나때문에
en: I’m sorry... that was all my fault.

source: ...믿어
en: of course I trust you guys.

source: 음향팀!{j}뭐하는 거야?!
en: audio team! what are you waiting for?!{j}

source: 내가 치유마법을 쓸 수 있었으면 좋았을 텐데..
en: I wish I could use healing magic myself.

source: 우리 지금 할 수 있는 최고를 보여주자 형
en: so let’s put our best foot forward, eugene.

source: 넌 간절 했던 거지.
en: ...even though you didn’t express it.

source: 응.
en: o-okay.

source: 비몽사몽
en: rustle

source: 무례하게 굴 생각은 없었습니다.
en: I did not intend to be rude, ma’am.

source: 슬슬 들어가자, 형.
en: now let’s head back, eugene.

source: 우리가 모두를 구할 수 있을 만큼
en: I do. I want power...

source: 많은 희생도 감수했습니다.{j}그렇게 부단히 노력해
en: they have also made great sacrifices...{j}

source: 으아아악!!
en: aghhh!

source: 바로 리허설 들어갈거니까 준비하고 따라와.
en: we’re going straight into rehearsals. follow me.

source: 소울와인 Soul Wine
en: Soul Wine

source: 흐흐흐
en: teehee

source: 허튼짓 할 생각이라면...
en: don’t you dare try to pull a trick...

source: 안 그럼 다들 무슨 수로 스케줄을 소화하겠어?
en: if not, how does everyone else handle their busy schedules?

source: 더군다나 난 마법도 못 써.
en: not only that, I can’t use magic.

source: 아!
en: oh!

source: 그건 세상을 구할 힘이니까.
en: that power is the power to save the world.

source: 뭐라고?!!{j}인마?!
en: what did you just say, you punk?!

source: 괜찮을 거야.{j}저 정도로는 큰 탈은 없을 거다.
en: he’ll be fine. such level of magic shouldn’t do much harm.{j}

source: ···아, 살았..
en: that was--

source: 좋아.
en: I look forward to seeing...

source: 달려!!
en: run!!

source: 이번엔 절대 실수하지 않아...
en: I won’t make a mistake this time...

source: 타닷-
en: zoom

source: 아...그런데 얜 어떡하지?
en: uhm... but what about this fella?
